from numpy import *

import lab1

# #
# m = 3
# n = 5
# A = array([
#     [5.0, 9.0, 1.0, 0.0, 0.0],
#     [3.0, 3.0, 0.0, 1.0, 0.0],
#     [2.0, 1.0, 0.0, 0.0, 1.0]
# ])
# b = array([45.0, 19.0, 10.0])
# c = array([5.0, 6.0, 0.0, 0.0, 0.0])
# x_0 = array([0.0, 0.0, 45.0, 19.0, 10.0])
# J = array([3, 4, 5])

#
# # пример 1 из задачника
# m = 2  # кол-во видов расходов
# n = 4  # кол-во видов продукции
# A = array([  # массив условий
#     [1.0, 1.0, 1.0, 0.0],
#     [5.0, 2.0, 0.0, 1.0]
#
# ])
# b = array([4.0, 10.0])  # массив расходов
# c = array([5.0, 3.0, 0.0, 0.0])  # массив стоимостей
# x_0 = array([0.0, 0.0, 4.0, 10.0])  # начальный план
# J = array([3, 4])  # базисные индексы


# m = 3
# n = 8
# c = array([2.0, 2.0, 1.0, -10.0, 1.0, 4.0, -2.0, -3.0])
# b = array([-2.0, 4.0, 3.0])
# A = array([  # массив условий
#     [-2.0, -1.0, 1.0, -7.0, 0.0, 0.0, 0.0, 2.0],
#     [4.0, 2.0, 1.0, 0.0, 1.0, 5.0, -1.0, -5.0],
#     [1.0, 1.0, 0.0, -1.0, 0.0, 3.0, -1.0, 1.0],
# ])
# J = array([2, 5, 7])
# y = array([1.0, 1.0, 1.0])
# small_delta = array([1.0, 0.0, 1.0, 2.0, 0.0, 4.0, 0.0, 1.0])


#
# m = 3
# n = 8
# c = array([2.0, 2.0, 1.0, -10.0, 1.0, 4.0, 0.0, -3.0])
# b = array([-2.0, 4.0, 3.0])
# A = array([  # массив условий
#     [-2.0, -1.0, 1.0, -7.0, 0.0, 0.0, 0.0, 2.0],
#     [4.0, 2.0, 1.0, 0.0, 1.0, 5.0, -1.0, -5.0],
#     [1.0, 1.0, 0.0, 1.0, 0.0, 3.0, 1.0, 1.0],
# ])
# J = array([2, 5, 7])
# y = array([1.0, 1.0, 1.0])
# small_delta = array([1.0, 0.0, 1.0, 4.0, 0.0, 4.0, 0.0, 1.0])

# m = 3
# n = 8
# c = array([5.0, 2.0, 3.0, -16.0, 1.0, 3.0, -3.0, -12.0])
# b = array([-2.0, -4.0, -2.0])
# A = array([  # массив условий
#     [-2.0, -1.0, 1.0, -7.0, 0.0, 0.0, 0.0, 2.0],
#     [4.0, 2.0, 1.0, 0.0, 1.0, 5.0, -1.0, -5.0],
#     [1.0, 1.0, 0.0, -1.0, 0.0, 3.0, -1.0, 1.0],
# ])
# J = array([1, 2, 3])
# y = array([1.0, 2.0, -1.0])
# small_delta = array([1.0, 0.0, 1.0, 4.0, 0.0, 4.0, 0.0, 1.0])




# m = 3
# n = 8
# A = array([
#    [-2.0, -1.0, 1.0, -7.0, 0.0, 0.0, 0.0, 2.0],
#    [4.0, 2.0, 1.0, 0.0, 1.0, 5.0, -1.0, -5.0],
#    [1.0, 1.0, 0.0, -1.0, 0.0, 3.0, -1.0, 1.0]
# ])
# b = array([-2.0, -4.0, -2.0])
# c = array([5.0, 2.0, 3.0, -16.0, 1.0, 3.0, -3.0, -12.0])
# y = array([1.0, 2.0, -1.0])
# J = array([1, 2, 3])
#
# m = 3
# n = 8
# A = array([
#    [-2.0, -1.0, 1.0, -7.0, 1.0, 0.0, 0.0, 2.0],
#    [-4.0, 2.0, 1.0, 0.0, 5.0, 1.0, -1.0, 5.0],
#    [1.0, 1.0, 0.0, -1.0, 0.0, 3.0, -1.0, 1.0]
# ])
# b = array([-2.0, 4.0, -2.0])
# c = array([-12.0, 2.0, 2.0, -6.0, 10.0, -1.0, -9.0, 8.0])
# y = array([1.0, 2.0, -1.0])
# J = array([2, 4, 6])





# m = 3
# n = 8
# A = array([
#     [-2.0, -1.0, 1.0, -7.0, 0.0, 0.0, 0.0, 2.0],
#     [4.0, 2.0, 1.0, 0.0, 1.0, 5.0, -1.0, -5.0],
#     [1.0, 1.0, 0.0, -1.0, 0.0, 3.0, -1.0, 1.0]
# ])
# b = array([-2.0, -4.0, -2.0])
# c = array([5.0, 2.0, 3.0, -16.0, 1.0, 3.0, -3.0, -12.0])
# y = array([1.0, 2.0, -1.0])
# J = array([1, 2, 3])
#
# print(lab2.double_simplex(m, n, c, b, A, J, y, lab2.make_small_delta(c, A, y)))








# m = 3
# n = 8
# A = array([
#     [-2.0, -1.0, 1.0, -7.0, 0.0, 0.0, 0.0, 2.0],
#     [4.0, 2.0, 1.0, 0.0, 1.0, 5.0, -1.0, -5.0],
#     [1.0, 1.0, 0.0, -1.0, 0.0, 3.0, -1.0, 1.0]
# ])
# b = array([-2.0, -4.0, -2.0])
# c = array([5.0, 2.0, 3.0, -16.0, 1.0, 3.0, -3.0, -12.0])
# y = array([1.0, 2.0, -1.0])
# J = array([1, 2, 3])
# correct_result = ([0, 0, 0, 0.40000000000000002, 0, 0, 2.0000000000000004, 0.39999999999999997], 4)
# print(lab2.double_simplex(m, n, c, b, A, J, y, lab2.make_small_delta(c, A, y)))


def inputValues(path="input"):
    m, n, A, b, c, dmin, dmax, J = 0, 0, [], [], [], [], [], []
    with open(path) as f:
        m = int(f.readline())
        n = int(f.readline())
        for _ in range(m):
            A.append([float(number) for number in f.readline().split(" ")])
        A = array(A)
        b = array([float(number) for number in f.readline().split(" ")])
        c = array([float(number) for number in f.readline().split(" ")])
        dmin = array([float(number) for number in f.readline().split(" ")])
        dmax = array([float(number) for number in f.readline().split(" ")])
        J = array([int(number) for number in f.readline().split(" ")])

    return m, n, A, b, c, dmin, dmax, J
# m = 2
# n = 4
# A = array([
#     [1.0, -5.0, 1.0, 0.0],
#     [-3.0, 1.0, 0.0, 1.0]
# ])
# b = array([-10.0, -12.0])
# c = array([0.0, -6.0, 1.0, 0.0])
# dmin = array([0.0, 0.0, 0.0, 0.0])
# dmax = array([6.0, 6.0, 6.0, 6.0])
# J = array([3, 4])


m, n, A, b, c, dmin, dmax, J = inputValues()


# correct_result = ([5.0, 3.0, 0.0, 0.0], 1)
print(lab1.double_simplex(m, n, c, b, A, J, dmin, dmax))
