import unittest

from numpy import *

import lab1
import lab1bounds

class SimplexTest(unittest.TestCase):

    #dolm test
    def test1(self):
        m = 3
        n = 5
        A = array([
            [5.0, 9.0, 1.0, 0.0, 0.0],
            [3.0, 3.0, 0.0, 1.0, 0.0],
            [2.0, 1.0, 0.0, 0.0, 1.0]
        ])
        b = array([45.0, 19.0, 10.0])
        c = array([5.0, 6.0, 0.0, 0.0, 0.0])
        x_0 = array([0.0, 0.0, 45.0, 19.0, 10.0])
        J = array([3, 4, 5])

        correct_result = ([3.0, 3.333, 0.0, 0.0, 0.667], 35.0, 2)
        assert correct_result == lab1.simplex(m, n, A, b, c, x_0, J)

    # пример 1 из книги
    def test2(self):
        m = 4  # кол-во видов расходов
        n = 8  # кол-во видов продукции
        A = array([  # массив условий
            [0.0, 1.0, 4.0, 1.0, 0.0, -3.0, 5.0, 0.0],
            [1.0, -1.0, 0.0, 1.0, 0.0, 0.0, 1.0, 0.0],
            [0.0, 7.0, -1.0, 0.0, -1.0, 3.0, 8.0, 0.0],
            [1.0, 1.0, 1.0, 1.0, 0.0, 3.0, -3.0, 1.0]
        ])
        b = array([6.0, 10.0, -2.0, 15.0])  # массив расходов
        c = array([-5.0, -2.0, 3.0, -4.0, -6.0, 0.0, -1.0, -5.0])  # массив стоимостей
        x_0 = array([4.0, 0.0, 0.0, 6.0, 2.0, 0.0, 0.0, 5.0])  # начальный план
        J = array([1, 4, 5, 8])  # базисные индексы

        correct_result = ([10.0, 0.0, 2.2, 0.0, 2.6, 0.933, 0.0, 0.0], -59.0, 2)
        assert correct_result == lab1.simplex(m, n, A, b, c, x_0, J)

    #самостоятельная задача1
    def test3(self):
        m = 4
        n = 8
        A = array([
            [0.0, 1.0, 4.0, 1.0, 0.0, -8.0, 1.0, 5.0],
            [0.0, -1.0, 0.0, -1.0, 0.0, 0.0, 0.0, 0.0],
            [0.0, 2.0, -1.0, 0.0, -1.0, 3.0, -1.0, 0.0],
            [1.0, 1.0, 1.0, 1.0, 0.0, 3.0, 1.0, 1.0]
        ])
        b = array([36.0, -11.0, 10.0, 20.0])
        c = array([-5.0, 2.0, 3.0, -4.0, -6.0, 0.0, 1.0, -5.0])
        x_0 = array([4.0, 5.0, 0.0, 6.0, 0.0, 0.0, 0.0, 5.0])
        J = array([1, 2, 4, 8])
        correct_result = ([0.0, 9.5, 5.333, 1.5, 0.0, 0.0, 3.667, 0.0], 32.666666666666664, 3)
        assert correct_result == lab1.simplex(m, n, A, b, c, x_0, J)


 #самостоятельная задача2
    def test4(self):
        m = 4
        n = 8
        A = array([
            [0.0, 1.0, 1.0, 1.0, 0.0, -8.0, 1.0, 5.0],
            [0.0, -1.0, 0.0, -7.5, 0.0, 0.0, 0.0, 2.0],
            [0.0, 2.0, 1.0, 0.0, -1.0, 3.0, -1.4, 0.0],
            [1.0, 1.0, 1.0, 1.0, 0.0, 3.0, 1.0, 1.0]
        ])
        b = array([15.0, -45.0, 1.8, 19.0])
        c = array([-6.0, -9.0, -5.0, 2.0, -6.0, 0.0, 1.0, 3.0])
        x_0 = array([4.0, 0.0, 6.0, 6.0, 0.0, 0.0, 3.0, 0.0])
        J = array([1, 3, 4, 7])
        correct_result = ([0.0, 0.0, 0.0, 7.055, 0.0, 1.803, 2.578, 3.958], 28.562793265249795, 2)
        assert correct_result == lab1.simplex(m, n, A, b, c, x_0, J)

 #самостоятельная задача3
    def test5(self):
        m = 3
        n = 8
        A = array([
            [0.0, -1.0, 1.0, -7.5, 0.0, 0.0, 0.0, 2.0],
            [0.0, 2.0, 1.0, 0.0, -1.0, 3.0, -1.5, 0.0],
            [1.0, -1.0, 1.0, -1.0, 0.0, 3.0, 1.0, 1.0]
        ])
        b = array([6.0, 1.5, 10.0])
        c = array([-6.0, -9.0, -5.0, 2.0, -6.0, 0.0, 1.0, 3.0])
        x_0 = array([4.0, 0.0, 6.0, 0.0, 4.5, 0.0, 0.0, 0.0])
        J = array([1, 3, 5])
        d_down = array([0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0])
        d_up = array([inf, inf, inf, inf, inf, inf, inf, inf])
        correct_result = ([0.0, 0.75, 0.0, 2.682, 0.0, 0.0, 0.0, 13.432], 38.909090909090907, 3)
        assert correct_result == lab1bounds.simplex(m, n, A, b, c, x_0, J, d_down, d_up)


    def testexam(self):
        m = 3
        n = 8
        df = array([2.0,5.0,-1.0,-1.0,3.0,4.0,5.0,0.0])
        d_down = array([0.0,0.0,-1.0,-1.0,-1.0,-1.0,-1.0,0.0])
        d_up = array([6.0,5.0,6.0, 4.0,6.0,5.0,5.0,7.0])

        A = array([
            [1.0, 3.0, 6.0, 1.0, 0.0, 0.0, -6.0, 2.0],
            [0.0, -2.0, 3.0, 4.0, 0.0, 1.0, 4.0, -1.0],
            [1.0, 1.0, -1.0, 3.0, 1.0, 0.0, 3.0, 4.0],
        ])
        J = array([1, 5, 6])

        b =  A.dot(df)
        c = array([2.0, -1.0, 3.0, -4.0, -3.0, 6.0, 6.0, -2.0])
        lab1bounds.simplex(m, n, A, b, c, df, J, d_down, d_up)


if __name__ == "__main__":
    unittest.main()
