import unittest

from numpy import *

import lab4


class TransportTest(unittest.TestCase):
    # задача 1
    def test1(self):
        m = 4
        n = 8
        C = array([[-3.0, 6.0, 7.0, 12.0, 6.0, -3.0, 2.0, 16.0],
                   [4.0, 3.0, 7.0, 10.0, 0.0, 1.0, -3.0, 7.0],
                   [19.0, 3.0, 2.0, 7.0, 3.0, 7.0, 8.0, 15.0],
                   [1.0, 4.0, -7.0, -3.0, 9.0, 13.0, 17.0, 22.0]])
        a = array([20.0, 11.0, 18.0, 27.0])
        b = array([11.0, 4.0, 10.0, 12.0, 8.0, 9.0, 10.0, 4.0])

        correct_result = (
            [[11.0, 0.0, 0.0, 0.0, 0.0, 9.0, 0.0, 0.0, 0.0],
             [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 10.0, 1.0, 0.0],
             [0.0, 4.0, 0.0, 0.0, 8.0, 0.0, 0.0, 3.0, 3.0],
             [0.0, 0.0, 10.0, 12.0, 0.0, 0.0, 0.0, 0.0, 5.0]], -108.0)

        assert correct_result == lab4.method_of_potentials(C, a, b)

    # задача 2
    def test2(self):
        m, n = 4, 8
        C = array([[-3.0, 10.0, 70.0, -3.0, 7.0, 4.0, 2.0, -20.0],
                   [3.0, 5.0, 8.0, 8.0, 0.0, 1.0, 7.0, -10.0],
                   [-15.0, 1.0, 0.0, 0.0, 13.0, 5.0, 4.0, 5.0],
                   [1.0, -5.0, 9.0, -3.0, -4.0, 7.0, 16.0, 25.0]])  # таблица с издержками
        a = array([15.0, 12.0, 18.0, 20.0])  # таблица запасами на складазх
        b = array([5.0, 5.0, 10.0, 4.0, 6.0, 20.0, 10.0, 5.0])  # таблица потребителей

        correct_result = ([[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 10.0, 5.0],
                           [0.0, 0.0, 0.0, 0.0, 0.0, 12.0, 0.0, 0.0],
                           [5.0, 0.0, 10.0, 0.0, 0.0, 3.0, 0.0, 0.0],
                           [0.0, 5.0, 0.0, 4.0, 6.0, 5.0, 0.0, 0.0]], -154.0)

        assert correct_result == lab4.method_of_potentials(C, a, b)

    # пример 1
    def test3(self):
        m = 3
        n = 5
        C = array([[2.0,   8.0, -5.0,  7.0, 10.0],
                   [11.0,  5.0,  8.0, -8.0, -4.0],
                   [1.0,   3.0,  7.0,  4.0,  2.0]])  # таблица с издержками
        a = array([20.0, 30.0, 25.0])  # таблица запасами на складазх
        b = array([10.0, 10.0, 10.0, 10.0, 10.0])  # таблица потребителей

        correct_result =([[0.0, 0.0, 10.0, 0.0, 0.0, 10.0],
                          [0.0, 0.0, 0.0, 10.0, 10.0, 10.0],
                          [10.0, 10.0, 0.0, 0.0, 0.0, 5.0]], -130.0)

        assert correct_result == lab4.method_of_potentials(C, a, b)


# пример 1
    def test4(self):
        m = 7
        n = 7
        C = array([[2.0, -3.0, 4.0,  5.0, -1.0, -2.0, 4.0],
                   [0.0, 1.0, 1.0, 4.0, -3.0, 2.0, 1.0],
                   [1.0, 2.0, 4.0, -3.0, 2.0, -1.0, 6.0],
                   [-1.0, 2.0, -7.0, 8.0, 6.0, -4.0, 3.0],
                   [1.0, -9.0, 8.0, 6.0, -9.0, 7.0, 10.0],
                   [-3.0, 7.0, 6.0, -3.0, 2.0, 1.0, -1.0],
                   [2.0, -1.0, 2.0, -1.0, 3.0, 4.0, -1.0]])  # таблица с издержками
        a = array([4.0,4.0,4.0,4.0,4.0,4.0,4.0])  # таблица запасами на складазх
        b = array([4.0,4.0,4.0,4.0,4.0,4.0,4.0])  # таблица потребителей

        correct_result =([[0.0, 0.0, 10.0, 0.0, 0.0, 10.0],
                          [0.0, 0.0, 0.0, 10.0, 10.0, 10.0],
                          [10.0, 10.0, 0.0, 0.0, 0.0, 5.0]], -130.0)

        assert correct_result == lab4.method_of_potentials(C, a, b)

if __name__ == "__main__":
    unittest.main()

# never compare numpy list in unittests
