%Найти численное решение уравнения теплопроводности с точностью 0.001.
clc;% очистка командной строки
clear;% очистка консоли
reset(symengine);% рестарт
syms x t x0 x1 t0 t1 h s p q;
x0 = 0;
x1 = 1; 
t0 = 0; 
t1 = 1; 
N = 20; 
M = 20; 
h = (x1-x0)/N; 
tau = (t1-t0)/M;
f(x,t) = sin(14)*t + cos(14)*x + 1;% заданные
s(x) = 0.5*x^2;% достаточно
p(t) = 0.5*t^2;% гладкие
q(t) = 0.5+0.5*t^2 + t;% функции
y = zeros(N+1,M+1);% наша сетка
for i=2:N
    y(i,1) = s(h*(i-1));%первое начальное условие
end
for i = 1:M+1
    y(1,i) = p((i-1)*tau);% второе
    y(M+1,i) = q(tau*(i-1));% начальное условие
end
k = tau/(h^2);
for i = 2:N
    for j = 2:M+1
        y(i,j) = k*y(i-1,j-1) + (1-2*k)*y(i,j-1) + k*y(i+1,j-1) + tau*f((i-1)*h,(j-1)*tau); %разностное уравнение относительно y(i,j)
    end
end
mesh(0:tau:1,0:h:1,y);  %построение пространственной модели
figure;  % отобразить график
plot3(0:tau:1, 0:h:1,y);% отображение графика
disp(y); %отображение на консольпеременой у
